<!DOCTYPE html>
<html lang="fi">
    <head>
      <meta charset="UTF-8">
      <meta name="viewport" content="width=device-width, initial-scale=1">
      <title>Linux jakelut</title>
      <link rel="stylesheet" href="styles.css">
    </head>
      <body>
        <header>
        <h2>Linux jakelut</h2>
        </header>
        <section>
          <nav>
             <a href=index.html>Pääsivu</a> |
             <a href=second.html>Eri jakelut</a> |
             <a href=third.html>Miksi vaihtaa Linux käyttöj&auml;rjestelm&auml;&auml;n?</a>
          </nav>
          <div class="vertical-menu">
           <ul>
            <li><a href="https://www.adminschoice.com/download-linux-top-10-free-linux-distributions-for-desktop-and-servers" target="_blank">Linux Download : Top 10 Free Linux Distributions for Desktop and Servers</a></li>
            <li><a href="https://distrowatch.com/?language=en" target="_blank">Distrowatch</a></li>
           </ul>
          </div>
          <article>
            <p> On paljon erilaisia Linux jakeluja eri tarkoituksiin. Alla on listattu muutamia, ja keille/mihin k&auml;ytt&ouml;tarkoitukseen ne on suunnattu:</p>
            <ul>
              <li><p>Linux mint: t&auml;m&auml; jakelu on suunnattu ihmisille, joilla ei ole aiempaa k&auml;ytt&ouml; kokemusta Linux k&auml;ytt&ouml;j&auml;rjestelmist&auml;. Se on helppo asentaa, sek&auml; helppo k&auml;ytt&auml;inen. Se perustuu Ubuntuun.</p></li>
              <li><p>Ubuntu: t&auml;m&auml; jakelu on my&ouml;s helppok&auml;ytt&ouml;inen, sek&auml; helppo asentaa. Se on kaikista suosituin Linux jakeluista, ja siit&auml; l&ouml;ytyy versiot sek&auml; palvelimille, ett&auml; ty&ouml;p&ouml;yt&auml;k&auml;ytt&ouml;&ouml;n.</p></li>
              <li><p>Debian: kyseinen jakelu on yksi vanhimmista jakeluista. Se on vakaa, mutta sit&auml; on paljon haastavampi k&auml;ytt&auml;&auml;, sek&auml; sen asennus on haastavampi. Molemmat sek&auml; Ubuntu, ett&auml; Linux mint perustuvat siihen.</p></li>
              <li><p>Kali Linux: t&auml;m&auml; jakelu on tarkoitettu tietoturvatestaukseen, ja se sis&auml;lt&auml;&auml; monia eri ty&ouml;kaluja esimerkiksi modeemin salasanan murtamiseen, sek&auml; internet sivujen yleisempien haavoittuvuuksien l&ouml;yt&auml;miseen. Se perustuu Debianiin</p></li>
              <li><p>Arch Linux: t&auml;m&auml; on henkil&ouml;kohtainen suosikkini. Arch Linux vaatii k&auml;ytt&auml;j&auml;lt&auml; paljon teknist&auml; osaamista, ja ongelmienratkaisutaitoja. Sen asennus tehd&auml;&auml;n alusta asti komentorivilt&auml;, eik&auml; sill&auml; ole graafista k&auml;ytt&ouml;liittym&auml;&auml; asennuksessa.</p></li>
            </ul>
          </article>
        </section>
        <footer>
        <p>Page made by: Onni H.</p>
        <p><a href="https://github.com/onniharkonen" target="_blank"><img src="img/GitHub.png" alt="Github"></a></p>
        </footer>
      </body>
</html>
